<a href="https://colab.research.google.com/github/Hbada/Python-data-analysis-lessons-notebooks/blob/master/Pandas_practice_notebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
# original notebook source: Google Colab
# exercise sources: Udemy course Python for Data Science... by Portilla
import numpy as np
import pandas as pd

## Create series

In [0]:
# create lists of data
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]

In [3]:
# create initial array
arr = np.array(my_data)
arr

array([10, 20, 30])

In [0]:
# create dictionary
d = {'a':10, 'b':20, 'c':30} # Python way to combine index with values

In [5]:
# create series
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
# create new series with an index
pd.Series(data=my_data, index=labels) # series use labels to denote indexes

a    10
b    20
c    30
dtype: int64

In [7]:
# shortcut to create series with index
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [8]:
# create series from any numpy array
zeroes = np.zeros(9)
pd.Series(zeroes)
# can't use .reshape(3,3) yet because .Series() requires 1D array

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
5    0.0
6    0.0
7    0.0
8    0.0
dtype: float64

In [9]:
# turn dictionary into series
pd.Series(d)
# automatically converts dictionary keys to index in the series

a    10
b    20
c    30
dtype: int64

In [10]:
# create series of strings
pd.Series(labels)
# index is automatically created, and labels array becomes the values

0    a
1    b
2    c
dtype: object

In [11]:
# can also create series holding other object types
pd.Series(data=[sum,len]) # series of functions

0    <built-in function sum>
1    <built-in function len>
dtype: object

## Using index in a series

In [12]:
# create two series with values then labels
ser1 = pd.Series([1, 2, 3, 4], ['Japan', 'Morocco', 'Canada', 'England'])
ser1

Japan      1
Morocco    2
Canada     3
England    4
dtype: int64

In [13]:
ser2 = pd.Series([1, 5, 3, 4], ['Japan', 'Italy', 'Canada', 'England'])
ser2

Japan      1
Italy      5
Canada     3
England    4
dtype: int64

In [14]:
# retrieve by label as index
ser2['Italy']

5

In [15]:
# see how indexes line up; add two series
ser1 + ser2 # integers become floats automatically so you don't lose info

Canada     6.0
England    8.0
Italy      NaN
Japan      2.0
Morocco    NaN
dtype: float64

## Create data frame

In [0]:
from numpy.random import randn
np.random.seed(101) # set a seed to match the course instructor's results

In [17]:
# create table of random normal distribution numbers in 5 rows, 4 columns
df = pd.DataFrame(randn(5, 4))
df

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [18]:
# create same table but with labels
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['Apples', 'Oranges', 'Bananas', 'Mangos'])
df

     Apples   Oranges   Bananas    Mangos
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

## Select portions of a dataframe

In [19]:
# select one column only
df['Apples']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: Apples, dtype: float64

In [20]:
# confirm that a column is considered a series
type(df['Apples'])

pandas.core.series.Series

In [21]:
# select multiple columns by inserting a list as index
df[['Apples', 'Mangos']]

     Apples    Mangos
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [22]:
# confirm that a multi-column selection is not a series, but rather a df
type(df[['Apples', 'Mangos']])

pandas.core.frame.DataFrame

In [23]:
# select a row using .loc method
df.loc['B']
# returns a series

Apples    -0.134841
Oranges    0.390528
Bananas    0.166905
Mangos     0.184502
Name: B, dtype: float64

In [24]:
# select a row using index location .iloc method
df.iloc[3] # returns row 4

Apples    -0.497104
Oranges   -0.754070
Bananas   -0.943406
Mangos     0.484752
Name: D, dtype: float64

In [25]:
# select a cell given a row and column
df.loc['B', 'Oranges']

0.39052784273374097

In [26]:
# display current df
df

     Apples   Oranges   Bananas    Mangos
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [27]:
# select a bunch of cells given a few rows and few columns to include
df.loc[['B', 'C'], ['Bananas', 'Mangos']]

    Bananas    Mangos
B  0.166905  0.184502
C  0.638787  0.329646

## Add and remove columns and rows

In [28]:
# add a column to df, in the context of a column operation
df['Sum'] = df['Apples'] + df['Oranges'] + df['Bananas'] + df['Mangos'] # sum column is new and contains sums
df

     Apples   Oranges   Bananas    Mangos       Sum
A  0.302665  1.693723 -1.706086 -1.159119 -0.868817
B -0.134841  0.390528  0.166905  0.184502  0.607094
C  0.807706  0.072960  0.638787  0.329646  1.849099
D -0.497104 -0.754070 -0.943406  0.484752 -1.709828
E -0.116773  1.901755  0.238127  1.996652  4.019761

In [29]:
# remove a column; requires axis=1 to specify it's a column
df.drop('Bananas', axis=1)

# notice the sum hasn't changed

     Apples   Oranges    Mangos       Sum
A  0.302665  1.693723 -1.159119 -0.868817
B -0.134841  0.390528  0.184502  0.607094
C  0.807706  0.072960  0.329646  1.849099
D -0.497104 -0.754070  0.484752 -1.709828
E -0.116773  1.901755  1.996652  4.019761

In [30]:
# confirm Bananas column still exists
df

     Apples   Oranges   Bananas    Mangos       Sum
A  0.302665  1.693723 -1.706086 -1.159119 -0.868817
B -0.134841  0.390528  0.166905  0.184502  0.607094
C  0.807706  0.072960  0.638787  0.329646  1.849099
D -0.497104 -0.754070 -0.943406  0.484752 -1.709828
E -0.116773  1.901755  0.238127  1.996652  4.019761

In [31]:
# delete column for real
df.drop('Bananas', axis=1, inplace=True)
# also delete Sum column since it was calculated on a previous columns
df.drop('Sum', axis=1, inplace=True)
df

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752
E -0.116773  1.901755  1.996652

In [32]:
# drop rows
df.drop('E', axis=0) # axis=0 can be omitted because it's the default value

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752

In [33]:
# notice it still has row E
df

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752
E -0.116773  1.901755  1.996652

In [34]:
# delete a row for real
df.drop('E', axis=0, inplace=True)
df

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752

## Shape of dataframe

In [35]:
# retrieve shape of dataframe, in (rows, columns)
# this is why axis=0 refers to rows and axis=1 refers to columns above
df.shape

(4, 3)

## Conditional selection

In [36]:
# return boolean for whether cell > 0
booldf = df > 0
booldf

   Apples  Oranges  Mangos
A    True     True   False
B   False     True    True
C    True     True    True
D   False    False    True

In [37]:
# cells that are True return a value; False give null result
df[booldf]

     Apples   Oranges    Mangos
A  0.302665  1.693723       NaN
B       NaN  0.390528  0.184502
C  0.807706  0.072960  0.329646
D       NaN       NaN  0.484752

In [38]:
# shortcut to df of a condition
df[df > 0]

     Apples   Oranges    Mangos
A  0.302665  1.693723       NaN
B       NaN  0.390528  0.184502
C  0.807706  0.072960  0.329646
D       NaN       NaN  0.484752

In [39]:
# note df as a variable still exists
df

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752

In [40]:
# find all positives in a column
df['Apples'] > 0 # returns a series

A     True
B    False
C     True
D    False
Name: Apples, dtype: bool

In [41]:
# select all rows that have True condition in Apples column
df[df['Apples'] > 0]

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
C  0.807706  0.072960  0.329646

In [42]:
# selections based on the results of the condition
# save the conditional selection to a variable
resultdf = df[df['Apples'] > 0]
# select one column of the results
resultdf['Oranges'] # all the Oranges values, for rows with positive Apples values

A    1.693723
C    0.072960
Name: Oranges, dtype: float64

In [43]:
# shortcut for prior cell
df[df['Apples'] > 0]['Oranges']
# process uses less memory where you use fewer variables

A    1.693723
C    0.072960
Name: Oranges, dtype: float64

In [44]:
# another shortcut; collect Orange & Mango cols for rows with positive Apples value
df[df['Apples']>0][['Oranges', 'Mangos']] # the 'filter' is a list thus double brackets
# combining like this, without breaking each step down and using variables...
# is example of abstraction
# reminds me of gloves as abstraction of German 'hand shoe' noun

    Oranges    Mangos
A  1.693723 -1.159119
C  0.072960  0.329646

## Selecting with multiple conditions

In [45]:
# show DataFrame involving mulitiple conditions with 'and'
df[(df['Apples'] > 0) & (df['Mangos'] > 0)]

     Apples  Oranges    Mangos
C  0.807706  0.07296  0.329646

In [46]:
# show DataFrame involving multiple conditions with 'or'
df[(df['Apples'] > 0) | (df['Mangos'] > 0)]

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752

## Reset index

In [47]:
df

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752

In [48]:
# reset index
df.reset_index()
# notice letters for rows are now in a column and you see index number

  index    Apples   Oranges    Mangos
0     A  0.302665  1.693723 -1.159119
1     B -0.134841  0.390528  0.184502
2     C  0.807706  0.072960  0.329646
3     D -0.497104 -0.754070  0.484752

In [49]:
# note that index number still won't show when you call the variable
df

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752

In [0]:
# make the index numbers remain in place
# df.reset_index(inplace=True)
# df

In [51]:
# create new list of index values using split to insert commas
newind = 'CA NY WY OR'.split()
newind

['CA', 'NY', 'WY', 'OR']

In [52]:
# append a list as new column of values
df['State'] = newind
df

     Apples   Oranges    Mangos State
A  0.302665  1.693723 -1.159119    CA
B -0.134841  0.390528  0.184502    NY
C  0.807706  0.072960  0.329646    WY
D -0.497104 -0.754070  0.484752    OR

In [53]:
# set a column's values as index
df.set_index('State', inplace=True) # inplace makes it permanent
df

         Apples   Oranges    Mangos
State
CA     0.302665  1.693723 -1.159119
NY    -0.134841  0.390528  0.184502
WY     0.807706  0.072960  0.329646
OR    -0.497104 -0.754070  0.484752

## Multi-index DataFrames
Aka. index hierarchy

In [0]:
# index levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]

In [55]:
# zip into tuples
hier_index = list(zip(outside, inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [56]:
# turns a tuple index into multi index
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [57]:
# create randn with 6 rows, 2 col
df = pd.DataFrame(randn(6,2))
df

          0         1
0 -0.993263  0.196800
1 -1.136645  0.000366
2  1.025984 -0.156598
3 -0.031579  0.649826
4  2.154846 -0.610259
5 -0.755325 -0.346419

In [58]:
# create same but with 'Multi index' and column labels A & B
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

## Selections in a multi-index dataframe

In [59]:
# select an outside index
df.loc['G1']

          A         B
1  0.147027 -0.479448
2  0.558769  1.024810
3 -0.925874  1.862864

In [60]:
# select outside index then an inner selection
df.loc['G1'].loc[1] # returns series of row 1 in section G1

A    0.147027
B   -0.479448
Name: 1, dtype: float64

In [61]:
# confirm the indexes have no names
df.index.names

FrozenList([None, None])

In [0]:
# name the indexes
df.index.names = ['Groups', 'Num']

In [63]:
# see dataframe with new index labels
df

                   A         B
Groups Num
G1     1    0.147027 -0.479448
       2    0.558769  1.024810
       3   -0.925874  1.862864
G2     1   -1.133817  0.610478
       2    0.386030  2.084019
       3   -0.376519  0.230336

In [64]:
# select a cell
df.loc['G2'].loc[2].loc['B'] # section G2, row 2, col B

2.084018530338962

In [65]:
# retrieve a cross section: something from each outer index
df.xs(1, level='Num') # select all Num=1 from all Groups

               A         B
Groups
G1      0.147027 -0.479448
G2     -1.133817  0.610478

## My example of something more meaningful
Eg. fruit harvest sampling data

In [0]:
# create outer and inner index labels
outside = ['Mon', 'Mon', 'Tue', 'Tue', 'Wed', 'Wed', 'Th', 'Th', 'Fri', 'Fri']
inside = [1, 2, 1, 2, 1, 2, 1, 2, 1, 2]

In [67]:
# zip into tuples
hier_index = list(zip(outside, inside))
hier_index

[('Mon', 1),
 ('Mon', 2),
 ('Tue', 1),
 ('Tue', 2),
 ('Wed', 1),
 ('Wed', 2),
 ('Th', 1),
 ('Th', 2),
 ('Fri', 1),
 ('Fri', 2)]

In [68]:
# turns a tuple index into multi index
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index # two rows for each day of the work week

MultiIndex(levels=[['Fri', 'Mon', 'Th', 'Tue', 'Wed'], [1, 2]],
           codes=[[1, 1, 3, 3, 4, 4, 2, 2, 0, 0], [0, 1, 0, 1, 0, 1, 0, 1, 0, 1]])

In [69]:
# create dataframe with 'Multi index' and column labels A & B
df = pd.DataFrame(randn(10,2), hier_index, ['Apples', 'Oranges'])
df

         Apples   Oranges
Mon 1  0.681209  1.035125
    2 -0.031160  1.939932
Tue 1 -1.005187 -0.741790
    2  0.187125 -0.732845
Wed 1 -1.382920  1.482495
    2  0.961458 -2.141212
Th  1  0.992573  1.192241
    2 -1.046780  1.292765
Fri 1 -1.467514 -0.494095
    2 -0.162535  0.485809

In [70]:
# name the indexes
df.index.names = ['Day', 'Sample']
# load the dataframe
df

              Apples   Oranges
Day Sample
Mon 1       0.681209  1.035125
    2      -0.031160  1.939932
Tue 1      -1.005187 -0.741790
    2       0.187125 -0.732845
Wed 1      -1.382920  1.482495
    2       0.961458 -2.141212
Th  1       0.992573  1.192241
    2      -1.046780  1.292765
Fri 1      -1.467514 -0.494095
    2      -0.162535  0.485809

In [71]:
# retrieve a cross section: only the second sample of the day
df.xs(2, level='Sample') # select all Sample=2 from every Day

       Apples   Oranges
Day
Mon -0.031160  1.939932
Tue  0.187125 -0.732845
Wed  0.961458 -2.141212
Th  -1.046780  1.292765
Fri -0.162535  0.485809

## Dealing with missing data

In [0]:
# create dictionary with some null values
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}

In [73]:
# create dataframe from the dictionary
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [74]:
# drop rows with null or missing values (called 'na')
df.dropna() # default is axis=0, so rows with NaN are dropped

     A    B  C
0  1.0  5.0  1

In [75]:
# create dataframe again
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [76]:
# drop based on columns, axis=1
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [77]:
# drop NaN with a threshhold
# a threshhold is the number of occurrences
df.dropna(thresh=2) # keep rows with at least 2 non-NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [78]:
df # full df remains

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [79]:
# fill in missing values
df.fillna(value='Absent')

        A       B  C
0       1       5  1
1       2  Absent  2
2  Absent  Absent  3

In [80]:
# replace NaN with mean of that column
df['A'].fillna(value=df['A'].mean())

# many theories exist about the best ways to fill missing values
# check online for recommendations and philosophies

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Groupby functions
Aka aggregate functions

In [81]:
# create some data
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales': [200, 120, 340, 124, 243, 350]}
# create dataframe from a dictionary
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [82]:
# group by Company
df.groupby('Company') # returns reference to object

In [0]:
# set results to a variable instead
byComp = df.groupby('Company')

In [84]:
# apply an aggregate function - mean
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [85]:
# apply an aggregate function - sum
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [86]:
# aggregate function - standard deviation
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [87]:
# apply aggregate function with a selection referring to an index value
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [88]:
# tighter code
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [89]:
# count instances in a column
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [90]:
# find max of each company group
df.groupby('Company').max() # person is the last in list for each company

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [91]:
# report min of each company
df.groupby('Company').min() # shows first person for each company

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [92]:
# give descriptive stats for each group
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [93]:
# show the same info in vertical format
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [94]:
# drill down to a single group
df.groupby('Company').describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

## Concatenating

In [0]:
# create some dataframes
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B': ['B0', 'B1', 'B2', 'B3'],
                   'C': ['C0', 'C1', 'C2', 'C3'],
                   'D': ['D0', 'D1', 'D2', 'D3']},
                  index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                   'B': ['B4', 'B5', 'B6', 'B7'],
                   'C': ['C4', 'C5', 'C6', 'C7'],
                   'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                   'B': ['B8', 'B9', 'B10', 'B11'],
                   'C': ['C8', 'C9', 'C10', 'C11'],
                   'D': ['D8', 'D9', 'D10', 'D11']},
                  index=[8, 9, 10, 11])

In [96]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [97]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [98]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [99]:
# concatenation joins a list of dataframes, one after the other
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [101]:
# concatenate with axis=1 to join at columns
pd.concat([df1, df2, df3], axis=1) # lots of missing values
# make sure joins happen in the best direction

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Merging
Like concatenating but uses logic to join things more usefully

In [0]:
# create dataframes with same key
left = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                    'A': ['A0', 'A1', 'A2'],
                    'B': ['B0', 'B1', 'B2']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                     'C': ['C0', 'C1', 'C2'],
                     'D': ['D0', 'D1', 'D2']})

In [105]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2

In [106]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2

In [107]:
# merge two dataframes on 'key', so that the duplicate column is merged
pd.merge(left, right, how='inner', on='key')
# can also insert a list for the on parameter

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

## Joining dataframes

In [0]:
# create dataframes with same index
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                    'B': ['B0', 'B1', 'B2']},
                   index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C1', 'C2'],
                     'D': ['D0', 'D1', 'D2']},
                    index=['K0', 'K1', 'K2'])

In [109]:
# join two dataframes
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

## Operations with dataframes

In [113]:
# create a dataframe
df = pd.DataFrame({'col1': [1,2,3,4],
                  'col2': [444,555,666,444],
                  'col3': ['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [114]:
# retrieve unique values in a column
df['col2'].unique()

array([444, 555, 666])

In [115]:
# count the unique values
len(df['col2'].unique()) # python method

3

In [117]:
# count using pandas nunique()
df['col2'].nunique()

3

In [118]:
# retrieve frequency of all values in dataframe
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [0]:
# apply method
def times2(x):
  return x*2

## Conditional selection from dataframe

In [120]:
# select from col1 using a condition
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [121]:
# select using multiple conditions
df[(df['col1'] >2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [0]:
# define a function
def times2(x):
  return x * 2

In [125]:
# apply your own function to a dataframe
df.apply(times2) # applies times2 function to every cell

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [126]:
# use built-in function len, applied to a dataframe column
df['col3'].apply(len) # original cells in df had 3-char strings

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [127]:
# use lambda expression instead of the function created above
df.apply(lambda x: x*2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz